IDEA StatiCa Open Model
OpeningCirc Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of circular opening in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Opening
 IdeaRS.OpenModel.Detail.OpeningCirc
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class OpeningCirc : Opening
Public Class OpeningCirc
	Inherits Opening
public ref class OpeningCirc : public Opening
The OpeningCirc type exposes the following members.
Constructors
Name | Description
OpeningCirc
 Constructor
Top
Properties
Name | Description
Diameter
 Diameter of opening
GeomId
 Id representing geometrical parts of Detail
 (Inherited from Opening.)
Id
 Element Id
 (Inherited from OpenElementId.)
InsertPoint
 Insert point 0 - 9
 (Inherited from Opening.)
MasterComponent
 Master component
 (Inherited from Opening.)
MasterPoint
 Master point 0 - 9
 (Inherited from Opening.)
Name
 Name
 (Inherited from Opening.)
Outline
 Outline of Oopening
 (Inherited from Opening.)
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
 (Inherited from Opening.)
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace